stm32-hotspot/STM32WBA-BLE-Encrypted-Advertising/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_EAD_Ext/STM32_WPAN/App/app_ble.c
  /* Initialize authentication */
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode             = CFG_MITM_PROTECTION;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin  = CFG_ENCRYPTION_KEY_SIZE_MIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax  = CFG_ENCRYPTION_KEY_SIZE_MAX;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin         = CFG_USED_FIXED_PIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin             = CFG_FIXED_PIN;
  bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode          = CFG_BONDING_MODE;
  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init_1*/

  /* USER CODE END Ble_Hci_Gap_Gatt_Init_1*/

  ret = aci_gap_set_authentication_requirement(bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
                                               CFG_SC_SUPPORT,
                                               CFG_KEYPRESS_NOTIFICATION_SUPPORT,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                               bleAppContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
                                               CFG_BD_ADDRESS_DEVICE);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gap_set_authentication_requirement command, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gap_set_authentication_requirement command\n");
  }

  /**
   * Initialize whitelist
   */
//  if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
//  {
//    ret = aci_gap_configure_whitelist();
//    if (ret != BLE_STATUS_SUCCESS)
//    {
//      APP_DBG_MSG("  Fail   : aci_gap_configure_whitelist command, result: 0x%x \n", ret);
//    }
//    else
//    {
//      APP_DBG_MSG("  Success: aci_gap_configure_whitelist command\n");
//    }
//  }
//  APP_DBG_MSG("==>> End Ble_Hci_Gap_Gatt_Init function\n\r");
  
  ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gap_clear_security_db command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gap_clear_security_db command\n\r");
  }

  LOG_INFO_APP("==>> End Ble_Hci_Gap_Gatt_Init function\n");
  
  /* Add new characteristic to GAP service */
   uint16_t SizeEncDataKeyMaterial_C = sizeof(encryption_key)+sizeof(initialization_vector);
   uuid.Char_UUID_16 = ENCRYPTED_DATA_KEY_MATERIAL_UUID;
   ret = aci_gatt_add_char(gap_service_handle,
                          UUID_TYPE_16,
                          (Char_UUID_t *) &uuid,
                          SizeEncDataKeyMaterial_C,
                          CHAR_PROP_READ | CHAR_PROP_INDICATE,
                          ATTR_PERMISSION_AUTHEN_READ | ATTR_PERMISSION_AUTHOR_READ,
                          GATT_NOTIFY_ATTRIBUTE_WRITE,
                          0x10,
                          CHAR_VALUE_LEN_CONSTANT,
                          &gap_EncrDataKayMaterial_handle);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_add_char command   : encryption_key+iv, error code: 0x%2X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_add_char command   : encryption_key+iv\n");
  }
  
  /* set in little indian the key */
  for (i=0;i<sizeof(encryption_key);i++)
  {
    encryption_key_little[15-i] = encryption_key[i];
  }
  /* set in little indian the IV */
  for (i=0;i<sizeof(initialization_vector);i++)
  {
    initialization_vector_little[7-i] = initialization_vector[i];
  }
  
  for (i=0;i<sizeof(initialization_vector);i++)
  {
    char_encr_data_key_mat[i] = initialization_vector_little[i];
  }
  
  for (i=0;i<sizeof(encryption_key);i++)
  {
    char_encr_data_key_mat[i+sizeof(initialization_vector)] = encryption_key_little[i];
  }
  
  /* write key/vector in characteristic -fixed value for the moment */  
  ret = aci_gatt_update_char_value(gap_service_handle, gap_EncrDataKayMaterial_handle, 0, SizeEncDataKeyMaterial_C, (uint8_t *)&char_encr_data_key_mat);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_gatt_update_char_value - EncrDataKayMaterial, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_gatt_update_char_value - EncrDataKayMaterial\n");
  }
  
  for (i=0;i<171;i++)
  {
    ead_AdvData[i] = i;
  }
  
  /* call encryption function */
  ret = aci_hal_ead_encrypt_decrypt(0x00, encryption_key_little, initialization_vector_little, sizeof(ead_AdvData), &ead_AdvData[0], &ead_data_encrypted_length, ead_data_encrypted);

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_ead_encrypt_decrypt, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_ead_encrypt_decrypt\n");
  } 
  APP_DBG_MSG("  ead_data_encrypted_length: 0x%02X\n", ead_data_encrypted_length);
  
  /* Initialization advertising data No Conn-No Scan */
  for (i=0;i<241;i++)
  {
    ead_AdvData_no_conn_no_scan[i] = i;
  }
  /* call encryption function */
  ret = aci_hal_ead_encrypt_decrypt(0x00, encryption_key_little, initialization_vector_little, sizeof(ead_AdvData_no_conn_no_scan), &ead_AdvData_no_conn_no_scan[0], &ead_data_encrypted_length_NCS, ead_data_no_conn_no_scan_encrypted);

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_ead_encrypt_decrypt, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_ead_encrypt_decrypt\n");
  } 
  APP_DBG_MSG("  ead_data_encrypted_length_NCS: 0x%02X\n", ead_data_encrypted_length_NCS);
}

